app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "たのしいRubya"], ["body", "htstdbdstbせtb"], ["user_id", 2], ["created_at", "2021-06-28 04:14:21.384241"], ["updated_at", "2021-06-28 04:14:21.384241"]]
SELECT "books".* FROM "books"

  def index
    @books = Book.all
---
SELECT "books".* FROM "books"

  def show
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]

  def edit
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "5nsu"], ["body", "qx02294s3hrkvuyty4u"], ["updated_at", "2021-06-27 05:38:59.562730"], ["id", 1]]