app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "ハーランド"], ["profile_image_id", "e3c2a4fceefe7175ebd05669df66f542dd19a879075fdcebca26f7269d9f"], ["updated_at", "2021-06-28 04:14:07.150143"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    @books = @user.books
    @book = Book.new
    @users = User.all